Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.Positions Property
 The positional attributes for a detail or a seam instance; one for a detail, N for a seam.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Point> Positions { get; }
Public ReadOnly Property Positions As List(Of Point)
	Get
Property Value
Type: List<Point>
See Also
Reference
ConnectionBase Class
Tekla.Structures.Plugins Namespace